{"modelTopology": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Conv2D", "config": {"filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "dtype": "float32", "batch_input_shape": [null, 28, 28, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2"}}, {"class_name": "Flatten", "config": {"name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "dtype": "float32"}}, {"class_name": "Dense", "config": {"units": 33, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "dtype": "float32"}}]}}, "weightsManifest": [{"paths": ["weights.bin"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [3136, 128], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [128, 33], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [33], "dtype": "float32"}]}], "format": "layers-model", "generatedBy": "train_cnn.py", "convertedBy": null}