{"modelTopology": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "dtype": "float32", "batch_input_shape": [null, 784]}}, {"class_name": "Dense", "config": {"units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "dtype": "float32"}}, {"class_name": "Dense", "config": {"units": 33, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "dtype": "float32"}}]}}, "weightsManifest": [{"paths": ["weights.bin"], "weights": [{"name": "dense_1/kernel", "shape": [784, 256], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [128, 33], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [33], "dtype": "float32"}]}], "format": "layers-model", "generatedBy": "train_sklearn.py", "convertedBy": null}